In [3]:
import pandas as pd

values = [ [7000, "R&D"], [ 9000, "인사" ], [ 3000, "영업"] ]
columns = [ "지출", "부서" ]

df = pd.DataFrame(values,columns=columns)
print(df)

     지출   부서
0  7000  R&D
1  9000   인사
2  3000   영업

In [12]:
import pandas as pd

values = [ [7000, "R&D"], [ 9000, "인사" ], [ 3000, "영업"] ]
dates = [ "20210101", "20210102", "20210103" ]

columns = [ "지출", "부서" ]

df = pd.DataFrame(values,index=dates,columns=columns)
df

            지출   부서
20210101  7000  R&D
20210102  9000   인사
20210103  3000   영업

In [22]:
import pandas as pd

values = [ [7000, "R&D"], [ 9000, "인사" ], [ 3000, "영업"] ]
dates = [ "20210101", "20210102", "20210103" ]

columns = [ "지출", "부서" ]

df = pd.DataFrame(values,columns=columns)
df.index = dates

df.iloc[1:,:]

            지출  부서
20210102  9000  인사
20210103  3000  영업

In [28]:
import pandas as pd

values = [ [7000, "R&D"], [ 9000, "인사" ], [ 3000, "영업"] ]
dates = [ "20210101", "20210102", "20210103" ]

columns = [ "지출", "부서" ]

df = pd.DataFrame(values,columns=columns)
df.index = dates

df.loc["20210101":"20210102", :"지출"]

            지출
20210101  7000
20210102  9000

In [16]:
df["지출"]

20210101    7000
20210102    9000
20210103    3000
Name: 지출, dtype: int64

In [45]:
import pandas as pd

values = [ 
    [7000, "R&D"], 
    [ 9000, "인사" ], 
    [ 3000, "영업"], 
    [ 20000, "인사" ], 
    [ 4000, "영업" ] 
]

dates = [ "20210101", "20210102", "20210103", "20210104", "20210105" ]
columns = [ "지출", "부서" ]

df = pd.DataFrame(values,columns=columns)
df.index = dates

df[ (df["지출"] >= 5000) | (df["부서"] == "인사") ]
df

             지출   부서
20210101   7000  R&D
20210102   9000   인사
20210103   3000   영업
20210104  20000   인사
20210105   4000   영업

# 조건 2개를 모두 만족시키는 코드를 작성해 봅시다.

조건1: 지출이 5000원 이상이면서 10000원 이하인 경우  
조건2: 영업팀의 지출인 경우

In [48]:
df[ ((df["지출"] >= 5000) & (df["지출"] <= 10000)) | (df["부서"] == "인사") ]

             지출   부서
20210101   7000  R&D
20210102   9000   인사
20210104  20000   인사

In [52]:
df[ (df.index < "20210103") & (df["지출"] <= 8000) ]

            지출   부서
20210101  7000  R&D

# 실습 1월 3일 이전의 데이터 중에서 8천원 이하인 항목을 추려봅시다.

In [70]:
import pandas as pd

values = [ 
    [7000, "R&D"], 
    [ 9000, "인사" ], 
    [ 3000, "영업"], 
    [ 20000, "인사" ], 
    [ 4000, "영업" ] 
]

dates = [ "20210101", "20210102", "20210103", "20210104", "20210105" ]
columns = [ "지출", "부서" ]

df = pd.DataFrame(values,columns=columns)
df.index = dates

df.groupby(by="부서").sum()

        지출
부서
R&D   7000
영업    7000
인사   29000

In [85]:
import pandas as pd

values = [ 
    [ None, "R&D"], 
    [ 9000, "인사" ], 
    [ 3000, "영업"], 
    [ 20000, "인사" ], 
    [ None, "영업" ],
    [ 35000, "영업"],
    [11000, "R&D"]
]

dates = [ 
    "20210101", "20210102", "20210103", 
    "20210104", "20210105", "20210106", 
    "20210107" 
]
columns = [ "지출", "부서" ]

df = pd.DataFrame(values,columns=columns, index=dates)
df.fillna(0)

               지출   부서
20210101      0.0  R&D
20210102   9000.0   인사
20210103   3000.0   영업
20210104  20000.0   인사
20210105      0.0   영업
20210106  35000.0   영업
20210107  11000.0  R&D

In [72]:
ndf = df.drop("지출", axis=1)
ndf

    부서
0  R&D
1   인사
2   영업
3   인사
4   영업
5   영업
6  R&D

In [112]:
import pandas as pd

values = [ 
    [7000, "R&D"], 
    [ 9000, "인사" ], 
    [ 3000, "영업"], 
    [ 20000, "인사" ], 
    [ 4000, "영업" ],
    [ 35000, "영업"],
    [11000, "R&D"]
]

dates = [ 
    "20210101", "20210101", "20210102", 
    "20210102", "20210103", "20210103", 
    "20210103" 
]
values = list( [*x, y] for x, y in zip(values, dates))
columns = [ "지출", "부서", "날짜" ]

df = pd.DataFrame(values,columns=columns)
filtered_df = df[ df["날짜"] > "20210101" ]
filtered_df.groupby(["부서","날짜"]).sum()

                 지출
부서  날짜
R&D 20210103  11000
영업  20210102   3000
    20210103  39000
인사  20210102  20000

In [117]:
import pandas as pd

values = [ 
    [ 50000, "R&D"], 
    [ 64000, "영업"], 
    [ 37000, "인사" ], 
]

columns = [ "지출", "부서" ]

expenses_dep = pd.DataFrame(values,columns=columns)
expenses_dep

      지출   부서
0  50000  R&D
1  64000   영업
2  37000   인사

In [153]:
import pandas as pd
import numpy as np
values = [ 
    [ 1, 40000], 
    [ 2, 27000], 
    [ 3, 44000], 
]

columns = [ "항목id", "수입"]
income_dep = pd.DataFrame(values, columns=columns)
tuples= [ ("식대","R&D"), ("비품구매","인사"), ("식대","영업") ]
income_dep.index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])
income_dep.loc[("식대", "R&D"),"수입"]

40000

In [ ]:
income_dep = pd.DataFrame(values)
income_dep.columns = columns
income_dep

joint_df = pd.merge(expenses_dep, income_dep, how='inner', left_on="부서", right_on='부서')
joint_df["수입대비지출비율(%)"] = joint_df.apply(lambda x: (x["지출"] / x["수입"]) * 100 , axis=1)
joint_df["수입대비지출비율(%)2"] = joint_df["수입대비지출비율(%)"].apply(lambda x: np.ceil(x))
joint_df.loc[[2,0,1]]

In [140]:
df = pd.merge(income_dep, expenses_dep,  how='inner', left_on="부서", right_on='부서')
df = df[["부서", "수입", "지출"]]

    부서     수입     지출
1  R&D  40000  50000
0   인사  27000  37000
2   영업  44000  64000

In [115]:
expenses_dep

부서
R&D    2
영업     3
인사     2
dtype: int64

In [33]:
import pandas as pd

df_1_values = [ [1,40], [1,25], [3,30], [2,35] ]
df_1_columns = [ "contryId", "units"]

left = pd.DataFrame(data=df_1_values,columns=df_1_columns)

df_2_values = [[3,"panama"], [4, "spain"]]
df_2_columns = ["id", "contryName"]

right = pd.DataFrame(data=df_2_values, columns=df_2_columns)

pd.merge(left, right, how='right', left_on="contryId", right_on='id').drop("id",axis=1)

   contryId  units contryName
0       3.0   30.0     panama
1       NaN    NaN      spain

In [30]:
left

   contryId  units
0         1     40
1         1     25
2         3     30
3         2     35

In [31]:
right

   id contryName
0   3     panama
1   4      spain

In [116]:
import pandas as pd

values = [ 
    [ 40000 ], 
    [ 27000 ], 
    [ 44000 ], 
]

index = [ 
    "R&D", 
    "인사", 
    "영업", 
]

columns = [ "수입" ]

income_dep = pd.DataFrame(values,columns=columns)
income_dep.index = index
income_dep

        수입
R&D  40000
인사   27000
영업   44000

In [57]:
joint_df["수입($)"] = joint_df["수입"].apply(lambda x: "$" +  str(x)[:2] +"," +str(x)[2:])
joint_df

        지출     수입    수입($)
R&D  18000  40000  $40,000
영업   42000  44000  $44,000
인사   29000  27000  $27,000

In [74]:
joint_df["비율(%)"] = joint_df.apply(lambda x: str(round(x["지출"] / x["수입"] * 100)) + "%", axis=1)
joint_df.filter(items=["인사","R&D"], axis=0) # index 값으로 필터링 하기
joint_df.to_csv('../../expense_rate.csv', sep="|",index=2, encoding="cp949") # 한글 인코딩 설정으로 엑셀에서 열어도 깨지지 않도록 한다.
joint_df

        지출     수입    수입($) 비율(%)
R&D  18000  40000  $40,000   45%
영업   42000  44000  $44,000   95%
인사   29000  27000  $27,000  107%

        지출     수입    수입($) 비율(%)
R&D  18000  40000  $40,000   45%
영업   42000  44000  $44,000   95%
인사   29000  27000  $27,000  107%

In [67]:
pd.read_csv("expense_rate.csv", sep="|")

      지출     수입    수입($) 비율(%)
0  18000  40000  $40,000   45%
1  42000  44000  $44,000   95%
2  29000  27000  $27,000  107%

In [100]:
import pandas as pd

values = [ 
    [ "20210101", 7000, "R&D", "식비" ], 
    [ "20210101", 9000, "인사", "식비" ], 
    [ "20210101", 3000, "영업", "식비" ], 
    [ "20210102", 20000, "인사", "비품구입비" ], 
    [ "20210102", 4000, "영업", "식비" ], 
    [ "20210102", 35000, "영업", "접대비" ], 
    [ "20210102", 11000, "영업", "식비" ], 
]

columns = [ 
    "날짜",
    "금액",
    "부서",
    "항목"
]

df = pd.DataFrame(values,columns=columns)
df

         날짜     금액   부서     항목
0  20210101   7000  R&D     식비
1  20210101   9000   인사     식비
2  20210101   3000   영업     식비
3  20210102  20000   인사  비품구입비
4  20210102   4000   영업     식비
5  20210102  35000   영업    접대비
6  20210102  11000   영업     식비

In [101]:
df

         날짜     금액   부서     항목
0  20210101   7000  R&D     식비
1  20210101   9000   인사     식비
2  20210101   3000   영업     식비
3  20210102  20000   인사  비품구입비
4  20210102   4000   영업     식비
5  20210102  35000   영업    접대비
6  20210102  11000   영업     식비

In [102]:
import numpy as np
df.pivot_table(index='날짜', values='금액', columns="항목", aggfunc=np.mean,fill_value=0)

항목        비품구입비           식비    접대비
날짜
20210101      0  6333.333333      0
20210102  20000  7500.000000  35000

In [109]:
df.pivot_table(index='부서', values=[ '금액' ], columns=[ "날짜" ], 
               aggfunc=np.sum,
               fill_value=0)

          금액
날짜  20210101 20210102
부서
R&D     7000        0
영업      3000    50000
인사      9000    20000

In [114]:
df.pivot_table(index='항목', values=[ '금액' ], columns=[ "날짜" ], 
               aggfunc=np.mean,
               fill_value=0)

                금액
날짜        20210101 20210102
항목
비품구입비     0.000000    20000
식비     6333.333333     7500
접대비       0.000000    35000

In [104]:
import numpy as np
df.pivot_table(index='날짜', values='금액', columns=[ "부서", "항목" ], 
               aggfunc=np.sum)

부서           R&D       영업                인사
항목            식비       식비      접대비    비품구입비      식비
날짜
20210101  7000.0   3000.0      NaN      NaN  9000.0
20210102     NaN  15000.0  35000.0  20000.0     NaN

In [107]:
df

         날짜     금액   부서     항목
0  20210101   7000  R&D     식비
1  20210101   9000   인사     식비
2  20210101   3000   영업     식비
3  20210102  20000   인사  비품구입비
4  20210102   4000   영업     식비
5  20210102  35000   영업    접대비
6  20210102  11000   영업     식비

In [106]:
import numpy as np
df.pivot_table(index='날짜', values=[ '금액', '부서' ], columns=[ "항목" ], 
               aggfunc={
                    '금액': [ np.sum, np.mean ],
                    '부서': 'count'
                },
               fill_value=0)

             금액                                             부서
           mean                        sum               count
항목        비품구입비           식비    접대비  비품구입비     식비    접대비 비품구입비 식비 접대비
날짜
20210101      0  6333.333333      0      0  19000      0     0  3   0
20210102  20000  7500.000000  35000  20000  15000  35000     1  2   1

In [135]:
data = [
    ["김김밥", "900128-1234566"],
    ["이열무", "910318-1234567"],
    ["최냉면", "810501-1234568"],
    ["박말이", "980501-1234569"]
]

df = pd.DataFrame(data, columns=["이름","주민번호"])
df["주민번호"] = df["주민번호"].apply(lambda x: replace_id(x))

df

    이름            주민번호
0  김김밥  900128-*******
1  이열무  910318-*******
2  최냉면  810501-*******
3  박말이  980501-*******

In [131]:
id = "900128-1234566"
word = id
if len(word) == 14 and word[:6].isdigit() and word[7:].isdigit():
    word = word[:7] + "*******"
word

'900128-*******'

In [134]:
def replace_id(id):
    if len(id) == 14 and id[:6].isdigit() and id[7:].isdigit():
        id = id[:7] + "*******"
    return id


replace_id("900128-1234566")

'900128-*******'

In [4]:
import re

data = [
    ["김김밥", "900128-1234566"],
    ["이열무", "910318-1234567"],
    ["최냉면", "810501-1234568"],
    ["박말이", "980501-1234569"]
]

df = pd.DataFrame(data, columns=["이름","주민번호"])

regx = re.compile("(\d{6})[-]\d{7}")
df["주민번호"] = df["주민번호"].apply(lambda x: regx.sub("\g<1>-*******", x))
df

    이름            주민번호
0  김김밥  900128-*******
1  이열무  910318-*******
2  최냉면  810501-*******
3  박말이  980501-*******

In [9]:
import re
regx = re.compile("[abc]")
m = regx.match("before")
m

In [3]:
# 정규식을 이용하여 올바른 이메일 형식인지 확인하기

import re

email_regex = re.compile("[A-Za-z0-9]@[A-Za-z0-9].[A-Za-z]")

email_input = "yerang040231@gmail.com"
email_regex.search(email_input)

In [4]:
# 정규식을 이용하여 전화번호 형식 확인하기

phone_regex = re.compile("^(01)\d{1}-\d{3,4}-\d{4}$")
phone_input = "010-4274-0974"
phone_regex.search(phone_input)